# Aggregating Data Using Statistical Functions in SQL

## Transformations in SQL SELECT Statements

Simple transformations and renaming operations can be done in-line in a query; DuckDB (and most SQL RDBMS flavors in general) support a wide variety of operations on a wide variety of date types.  

Here, we'll look mainly at numeric and text data:

| Code | Description |
| :--- | :--- |
| **`SELECT cos(x) FROM my_table`** | Get the cosine of the "x" column. |
| **`SELECT cos(x) as cs FROM my_table`** | Get the cosine of the "x" column and rename it to "cs". |
| **`SELECT cos(x) as cs, sin(x) as sc FROM my_table`** | Calculate the sine and cosine of x and make two columns out of them. |
| **`SELECT round(x, 2), floor(x), ceil(x) from my_table`** | Round x to 2 decimal places, round it down, and round it up. |
| **`SELECT x * 2, x + 2, x - 2, x / 2 FROM my_table`** | Do arithmetic on x. |
| **`SELECT upper(t), lower(t), reverse(t) FROM my_table`** | Uppercase, lowercase, and reverse the text in the t column. |
| **`SELECT left(t, 4), right(t, 4) FROM my_table`** | Extract the left-most 4 characters and right right-most 4 characters from t. |

  - Numeric Function: https://duckdb.org/docs/sql/functions/numeric
  - Text Functions: https://duckdb.org/docs/sql/functions/char
  - Overview over all supported types: https://duckdb.org/docs/sql/functions/overview

#### Download the Data

For the next sections, we'll be exploring some data from a Steinmetz et al NeuroPixel experiment, processed here into JSON files for our tabular analysis, along with some other familiar file types.  Please run the code below to download the data.  It will take 5-10 minutes to download.

In [ ]:
# %pip install tqdm webdav4 requests fsspec

In [2]:
from tqdm import tqdm
from pathlib import Path
from webdav4.fsspec import WebdavFileSystem

# https://uni-bonn.sciebo.de/s/oZql1bk0p1AvK0w
fs = WebdavFileSystem("https://uni-bonn.sciebo.de/public.php/webdav", auth=("oZql1bk0p1AvK0w", ""))
for name in tqdm(fs.ls("/", detail=False), desc="Downloading Data to data/stenmetz"):
    if not Path(f"data/steinmetz/{name}").exists():
        fs.download(name, f"data/steinmetz/{name}", recursive=True)

Downloading Data to data/stenmetz: 100%|██████████| 37/37 [01:32<00:00,  2.50s/it]

**Exercises**: Transform the columns in various the Steinmetz dataset

In [3]:
# %pip install duckdb pandas

In [4]:
from duckdb import sql

**Example**: Get the response time in milliseconds for all trials in the experiment.

In [24]:
query = """
SELECT                                    -- Select Specific Columns
    response_time * 1000 as resp_msecs    -- Multiply the response time column by 1000 and rename it.
FROM '**/trials.csv';                     -- Read all the CSV files into a table.
"""
sql(query).to_df()

        resp_msecs
0      1433.915727
1      2001.065710
2      1251.114625
3      1334.219182
4       683.367530
...            ...
13612          NaN
13613          NaN
13614          NaN
13615          NaN
13616          NaN

[13617 rows x 1 columns]

Get the feedback time in milliseconds for all trials in the experiment.

Get both the response time and feedback time in milliseconds for all trials in the experiment.

Lowercase the mouse name in the all sessions

In this experiment, the mouse's task is to compare the contrast levels of the left and right stimulus, and to decide which contrast is higher.  Use SQL to make a new `contrast_diff` column that subtracts `contrast_right` from `contrast_left`.

## Full-Table Aggregations

We can also run some basic statistics in SQL, making it useful for some quick summaries of our data.  This works the same way as transformations.  Let's try it out!

| Code | Description |
| :-- | :-- |
| **`SELECT count(*) FROM my_table`** | The number of rows in the table. |
| **`SELECT count(colA) FROM my_table`** | The number of values in colA in the table (same as the number of rows in the whole table.) |
| **`SELECT min(colA), max(colA) FROM my_table`** | The minimum and maximum values of colA |
| **`SELECT avg(colA), median(colA) FROM my_table`** | The mean and median values of colA |
| **`SELECT first(colA), last(colA) FROM my_table`** | The first and last values of colA (based on the ordering of the data) |

**Example**: How many sessions were recorded in the study?

In [49]:
sql('SELECT count(*) FROM "data/steinmetz/**/session.json"')

┌──────────────┐
│ count_star() │
│    int64     │
├──────────────┤
│           37 │
└──────────────┘

How many total trials were done in the experiment, across all sessions?

How many total cells were recorded in this experiment?

How many total sessions were done by the mouse named "Richards"?

How many cells were recorded in the hippocampus in this experiment?

What was the min and maximum values of the Left-Right CCF dimension recorded in the data (i.e. the most left coordinate and the most right coordinate)?

What was the mean (i.e. "average") value for each of the CCF coordinates?

What was the mean (i.e. "average") value for each of the CCF coordinates in the thalamus?

What was the average `response_type` (-1 is leftward wheel turn, +1 is rightward wheel turn, 0 is no wheel turn), where it was considered an "Active Trial" (i.e. when the mouse wasn't expected to just passively observe)?

## SQL GROUP BY for Groupwise Statistics

| Code | Description |
| :-- | :-- |
| **`SELECT name, avg(value) FROM my_table GROUP BY name`** | Get the mean value for every unique value of name |
| **`SELECT name, avg(value) FROM my_table GROUP BY ALL`** | Group the data by anything requested but not aggregated. |
| **`SELECT name, avg(value) FROM my_table GROUP BY name ORDER BY name`** | ... and order the rows by the name column.  |
| **`SELECT name, avg(value) FROM my_table GROUP BY name HAVING name LIKE "G%"`** | Only use groups where the name starts with "G" |

**Exercises**

**Example**: *For each contrast_left level*, what was the average `response_type` (-1 is leftward wheel turn, +1 is rightward wheel turn, 0 is no wheel turn), where it was considered an "Active Trial" (i.e. when the mouse wasn't expected to just passively observe)?

In [2]:
from duckdb import sql

In [3]:
query = """
SELECT
    contrast_left,
    round(avg(response_type), 2) AS mean_response_type
FROM "**/trials.csv"
WHERE active_trials = true
GROUP BY contrast_left
ORDER BY contrast_left
"""
sql(query)

┌───────────────┬────────────────────┐
│ contrast_left │ mean_response_type │
│     int64     │       double       │
├───────────────┼────────────────────┤
│             0 │              -0.35 │
│            25 │              -0.28 │
│            50 │               0.41 │
│           100 │               0.63 │
└───────────────┴────────────────────┘

*For each contrast_right level*, what was the average `response_type` (-1 is leftward wheel turn, +1 is rightward wheel turn, 0 is no wheel turn), where it was considered an "Active Trial" (i.e. when the mouse wasn't expected to just passively observe)?

*For each combination of contrast_left and contrast_right level*, what was the average `response_type` (-1 is leftward wheel turn, +1 is rightward wheel turn, 0 is no wheel turn), where it was considered an "Active Trial" (i.e. when the mouse wasn't expected to just passively observe)?

For each brain group, how many cells were recorded?

## Joining Multiple Tables: JOIN

| Code | Description |
| :-- | :-- |
**`FROM "a.csv" a`** | Give a variable name `a` to a table loaded from "a.csv" |
| **`FROM "a.csv" a JOIN "b.csv" b ON a.id = b.a_id`** | A two-way join, matching the "id" column in table a with the "a_id" column in table b. |
| **`FROM "a.csv" a JOIN "b.csv" b ON a.id = b.a_id JOIN "c.csv" c ON a.id = c.a_id`** | A three-way join. |

**Example**: Join the sessions and trials tables on the session ids, and show the resulting column names:

In [81]:
query = """
DESCRIBE
SELECT
    *
FROM "**/session.json" sessions
JOIN "**/trials.csv" trials 
ON sessions.id = trials.session_id
"""
sql(query)

┌────────────────┬─────────────┬─────────┬─────────┬─────────┬─────────┐
│  column_name   │ column_type │  null   │   key   │ default │  extra  │
│    varchar     │   varchar   │ varchar │ varchar │ varchar │ varchar │
├────────────────┼─────────────┼─────────┼─────────┼─────────┼─────────┤
│ session_date   │ DATE        │ YES     │ NULL    │ NULL    │ NULL    │
│ mouse          │ VARCHAR     │ YES     │ NULL    │ NULL    │ NULL    │
│ stim_onset     │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ bin_size       │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ id             │ VARCHAR     │ YES     │ NULL    │ NULL    │ NULL    │
│ contrast_left  │ BIGINT      │ YES     │ NULL    │ NULL    │ NULL    │
│ contrast_right │ BIGINT      │ YES     │ NULL    │ NULL    │ NULL    │
│ gocue          │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ stim_onset     │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ feedback_type  │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ feedback_time  │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ response_type  │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ response_time  │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ reaction_type  │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ reaction_time  │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ prev_reward    │ DOUBLE      │ YES     │ NULL    │ NULL    │ NULL    │
│ active_trials  │ BOOLEAN     │ YES     │ NULL    │ NULL    │ NULL    │
│ session_id     │ VARCHAR     │ YES     │ NULL    │ NULL    │ NULL    │
├────────────────┴─────────────┴─────────┴─────────┴─────────┴─────────┤
│ 18 rows                                                    6 columns │
└──────────────────────────────────────────────────────────────────────┘

Join the sessions and cells tables on the session ids, and show the resulting column names:

Load all of the trials from the "Richards" mouse.

Get all of the cells from the "Lederberg" mouse.

Get the average response time for each mouse, for each combination of contrast_left and contrast_right value, but only when there were active trials.

Join the sessions,  trials, and cells tables on the session ids, and show the resulting column names:

## (Demos) Pivoting Tables and Nesting SQL Statements

Analysis pipelines can get quite complex--there's a lot that we want from our data!  Below are some examples of analyses that uses nesting, pivoting, and exporting to Pandas to break down the analysis into multiple steps.

In [ ]:
# %pip install jinja2 matplotlib seaborn

In [ ]:
duckdb.sql(
"""
SELECT 
    contrast_right, 
    "0", "25", "50", "100"
FROM (
    PIVOT (
        SELECT
            contrast_left,
            contrast_right,
            round(avg(response_type), 2) AS mean_response_type
        FROM "**/trials.csv"
        WHERE active_trials = true AND response_type <> 0
        GROUP BY contrast_left, contrast_right
        ORDER BY contrast_left, contrast_right
    )
    ON contrast_left
    USING first(mean_response_type)
    GROUP BY contrast_right
)
"""
).to_df().set_index('contrast_right').style.format("{:.2f}")

In [ ]:
result = duckdb.sql(
"""
PIVOT (
    SELECT
        mouse,
        session_id,
        session_date,
        brain_groups,
        count(cell) as num_cells,
    FROM "**/cells.parquet" cells
    INNER JOIN "**/session.json" sessions ON cells.session_id = sessions.id
    GROUP BY ALL
)
ON brain_groups
USING sum(num_cells)
GROUP BY mouse
"""
).to_df()
result.set_index('mouse').convert_dtypes().style.format()